Repository: vanbess/SB-Dev-Underscores-WordPress-Theme-Boilerplate
Catalog: utilities/inc/gutenberg/inc/accordion/languages/*_formal.po
Languages: de_de

source: Multiple
de_de: Mehrfach

source: Allow multiple items to be opened at once.
de_de: Erlaube Sie das gleichzeitige Öffnen mehrerer Elemente.

source: All collapsible
de_de: Alle zusammenklappbar

source: Current behaviour:
de_de: Aktuelles Verhalten:

source: allow to collapse all items.
de_de: alle Elemente können zusammengeklappt werden.

source: at least one item will be always open.
de_de: mindestens ein Element ist immer offen.

source: Loading behavior
de_de: Verhalten beim Laden

source: Open all
de_de: Alle öffnen

source: All items are open when loading.
de_de: Alle Elemente sind beim Laden geöffnet.

source: Open first item
de_de: Erstes Element öffnen

source: Open first item when loading.
de_de: Beim Laden ist das erste Element geöffnet.

source: Accordion
de_de: Akkordeon

source: Collapsible content.
de_de: Zusammenklappbarer Inhalt.

source: Item
de_de: Element

source: Content
de_de: Inhalt
