Repository: vanbess/SB-Dev-Underscores-WordPress-Theme-Boilerplate
Catalog: utilities/inc/security/languages/*_formal.po
Languages: de_de

source: DB table prefix
de_de: DB-Tabellenpräfix

source: Your database table prefix is <code>%s</code>
de_de: Der Datenbank-Tabellenpräfix lautet <code>%s</code>

source: To prevent SQL injections (or at least make it more difficult) the database table prefix should not be WordPress' default <code>wp_</code> prefix. We recommend using the %s plugin to change that. Once changed you can deactivate and uninstall the plugin again.
de_de: Um SQL-Injections zu verhindern (oder zumindest zu erschweren), sollte der Datenbank-Tabellenpräfix nicht der Standardpräfix <code>wp_</code> von WordPress sein. Wir empfehlen die Verwendung des %s-Plugins, um dies zu ändern. Nach der Änderung können Sie das Plugin wieder deaktivieren und deinstallieren.

source: Your login url is <code>%s</code>
de_de: Die Login-URL lautet <code>%s</code>

source: Your login url is WordPress' default <code>/wp-login.php</code>.
de_de: Die Login-URL ist die Standard-WordPress URL <code>/wp-login.php</code>

source: Since the login page is publicly accessible it should be an unpredictable url. The default login url <code>/wp-login.php</code> is very predictable and exposes your site to hackers attempting to guess usernames and passwords.%s
de_de: Da die Anmeldeseite öffentlich zugänglich ist, sollte es sich um eine schwer vorhersehbare URL handeln. Die Standard-Login-URL <code>/wp-login.php</code> ist sehr vorhersehbar und setzt Ihre Website Hackern aus, die versuchen, Benutzernamen und Passwörter zu erraten.%s

source: We recommend using the %s plugin to change it.
de_de: Wir empfehlen das %s-Plugin zu verwenden.

source: You are not allowed to make REST-API requests to this route.
de_de: Sie dürfen keine REST-API-Anfragen an diese Route stellen.

source: Critical endpoints are disabled for non-authenticated users: %s
de_de: Kritische Endpunkte sind für nicht authentifizierte Benutzer deaktiviert: %s

source: Some REST-API endpoints contains vulnerable data (e.g. usernames) of your site which hackers can use to start their attacks.
de_de: Einige REST-API-Endpunkte enthalten sensible Daten (z.B. Benutzernamen) Ihrer Website, die Hacker zum Start ihrer Angriffe verwenden können.

source: No updates available
de_de: Keine Updates verfügbar

source: Updates available
de_de: Updates verfügbar

source: There are no updates available.
de_de: Es sind keine Updates verfügbar.

source: Many updates include security fixes. It is therefore important to keep WordPress itself and all plugins always up to date.%s
de_de: Viele Updates enthalten Sicherheitsfixes. Daher ist es wichtig, WordPress selbst und alle Plugins immer auf dem neuesten Stand zu halten.%s

source: Usernames
de_de: Benutzernamen

source: There is a user with login name <code><a href='%s'>%s</a></code>%s
de_de: Es gibt einen Benutzer mit dem Login-Namen <code><a href='%s'>%s</a></code>%s

source: and also with the role <code>administrator</code>
de_de: der auch noch die Rolle <code>administrator</code> hat.

source: Create new administrator user and delete the <i>old</i> one
de_de: Erstellen Sie einen neuen Administratorbenutzer und löschen Sie den <i>alten</i>

source: ... or change <code>user_login</code> directly in the database
de_de: ... oder ändern Sie <code>user_login</code> direkt in der Datenbank

source: The XML-RPC-API is either not reachable or disabled.
de_de: Die XML-RPC-API ist entweder nicht erreichbar oder deaktiviert.

source: It's best to disable it altogether since it's replaced by the REST-API.
de_de: Am besten deaktivieren Sie es ganz, da es durch die REST-API ersetzt wird.

source: The <code>xmlrpc.php</code> introduces security vulnerabilities and can be the target for attacks. Since it has been replaced by the REST-API it is best to disable it.
de_de: Die <code>xmlrpc.php</code> führt zu Sicherheitslücken und kann das Ziel von Angriffen sein. Da es durch die REST-API ersetzt wurde, ist es am besten, es zu deaktivieren.

source: Security
de_de: Sicherheit

source: To secure<sup>1</sup> your site from hackers, malicious attackers and automated bots and prevent DDoS- and brute-force-attacks, here are some points that should be met:
de_de: Um Ihre Website vor Hackern, böswilligen Angreifern und automatisierten Bots zu schützen<sup>1</sup> und DDoS- und Brute-Force-Angriffe zu verhindern, sollten folgende Punkte beachtet werden:

source: Further recommendations
de_de: Weitere Empfehlungen

source: Have a look at WordPress' <a href='%s'>site health</a> section
de_de: Schauen Sie sich den Abschnitt <a href='%s'>Zustand der Website</a> von WordPress an

source: We encourage you to use a 2-factor-authentication and recommend the %s plugin
de_de: Wir empfehlen Ihnen die Verwendung einer 2-Faktor-Authentifizierung und empfehlen das Plugin %s

source: <sup>1</sup> There will never be an absolute security but these points will help to keep it as secure as possible.
de_de: <sup>1</sup> Es wird nie eine absolute Sicherheit geben, aber diese Punkte werden dazu beitragen, Ihre Website so sicher wie möglich zu halten.

source: Your database table prefix is WordPress' default <code>wp_</code>
de_de: Der Datenbank-Tabellenpräfix ist WordPress' Standardpräfix <code>wp_</code>

source: File modifications
de_de: Dateiänderungen

source: File modifications via backend are allowed.%s
de_de: Dateiänderungen über das Backend sind erlaubt.%s

source: But in the development environment it always is. Please check on <i>stage</i> and <i>live</i>!
de_de: Aber in der Entwicklungsumgebung ist es immer so. Bitte prüfen Sie <i>Stage</i> und <i>Live</i>!

source: Actions like un/installing plugins/themes, downloading language packs, using the file editors, etc. should only be possible in the development environment. Because if an intruder gains backend access, they would be able to modify the codebase.
de_de: Aktionen wie das De-/Installieren von Plugins/Themes, das Herunterladen von Sprachpaketen, die Verwendung der Dateieditoren usw. sollten nur in der Entwicklungsumgebung möglich sein. Denn wenn ein Eindringling Zugriff auf das Backend erhält, könnte er die Codebasis ändern.

source: SPAM protection
de_de: Spamschutz

source: We've detected you've installed the CF7 plugin and some sort of SPAM protection%s.
de_de: Wir haben festgestellt, dass Sie das CF7-Plugin und eine Art SPAM-Schutz%s installiert haben.

source: There are CF7 forms without any protection%s
de_de: Es gibt CF7-Formulare ohne Schutz%s

source: It's important to prevent form spam because its impact ranges from annoyance to potential security risks by malicious links. Your reputation, the reputation of your client and the one of <i>your server</i> is at risk.%s
de_de: Es ist wichtig, Formular-Spam zu verhindern, da seine Auswirkungen von Belästigung bis hin zu potenziellen Sicherheitsrisiken durch bösartige Links reichen. Ihr Ruf, der Ihres Kunden und der <i>Ihres Servers</i> ist gefährdet.%s

source: We recommend using the %s plugin.
de_de: Wir empfehlen die Verwendung des %s-Plugins.

source: Secure your contact forms with some kind of SPAM protection
de_de: Sichern Sie Ihre Kontaktformulare mit einer Art SPAM-Schutz

source: No file modifications via backend are allowed.
de_de: Es sind keine Dateiänderungen über das Backend zulässig.

source: Disable updates
de_de: Updates deaktivieren

source: Updates
de_de: Aktualisierungen

source: Since generic WordPress usernames like <code>admin</code> are easier to guess, they pose a significant risk for your website. Also avoid accounts with identical login name and display name.
de_de: Generische WordPress-Benutzernamen wie <code>admin</code> sind leichter zu erraten und stellen sie ein erhebliches Risiko für Ihre Website dar. Vermeiden Sie außerdem Konten mit identischem Anmeldenamen und Anzeigenamen.

source: There are accounts with identical login name and display name:%s
de_de: Es gibt Konten mit identischem Anmeldenamen und Anzeigenamen:%s

source: There is a new version of WordPress available.
de_de: Es ist eine neue Version von WordPress verfügbar.

source: Updates available.
de_de: Updates verfügbar.

source: Please immediately run updates
de_de: Bitte umgehend Updates durchführen

source: Please notify the site administrator!
de_de: Bitte informieren Sie den Administrator!

source: These actions are only possible in the development environment!
de_de: Diese Aktionen sind nur in der Entwicklungsumgebung möglich!
